function distance = getDistance(trajectory)
% -------------------------------------------------------------
% 计算航迹的总长度
% -------------------------------------------------------------
% 参数:
%   trajectory: 飞机的航迹
%   startPos: 飞机的航迹起点
%   goalPos: 飞机的航迹终点
% -------------------------------------------------------------
% 返回值:
%   distance: 航迹的总长度
% -------------------------------------------------------------


% 使用 spline 函数对航迹进行三次样条插值，生成更多的点
X_seq=trajectory(1,:);
Y_seq=trajectory(2,:);
Z_seq=trajectory(3,:);
% 计算两架飞机的距离
dx = diff(X_seq);                         % 计算路径在 x 上相邻点的差值
dy = diff(Y_seq);                         % 计算路径在 y 上相邻点的差值
dz = diff(Z_seq);                         % 计算路径在 z 上相邻点的差值
distance = sum(sqrt(dx.^2 + dy.^2 + dz.^2));

end
